messages = [
"せいとのみなさん4月ですよ!まなびあふれるりゅうだいをつくるためにおかねかせぎをおねがいします!くにからのえんじょきん1億円ときゅうこうカードいちまいをもってスタートです!さいしょのもくてきちをきめました!$です!みなさんがさいしょにめざすもくてきちは$です!",#0
"サイコロをふります dですすむ", #1
"サイコロをふりました。でためは$です!", #2
"$1はプラスえきにとまった!プラス$2!$1のもちがねは$3になった!", #3
"$1はマイナスえきにとまった!マイナス$2!$1はしゃっきんをしたが、めんじょされてもちがね0円になった!", #4
"$1はマイナスえきにとまった!マイナス$2!$1のもちがねは$3になった!", #5
"$はカードがいっぱいだ!せっきょくてきにつかいましょう!", #6
"$1は$2をGETした!", #7
"$はたかくてかえません!", #8
"$をかいました!", #9
"$1が、$2をしょゆうしていますのでかえません!",#10
"$1にはえんじょきんをうけとっていただきます!$1には$2えんのえんじょきんがでました!それではみなさん!あたらしいもくてきちはここです!$3です!さあみなさん!$3にむかってがんばってください!",#11,
"$1をつかいました。でためは$2です!",#12
"$1さんは1ねんかんぶんのりし$2をうけとりました!!!!!!",#13
"しゅうりょうしました!!!ゆうしょうしゃは、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、そうしさん$1の$2さんです!おめでとうございます!"#14
]
