messages = [
"せいとのみなさん4月ですよ!まなびあふれるりゅうだいをつくるためにおかねかせぎをおねがいします!くにからのえんじょきん1億円ときゅうこうカードいちまいをもってスタートです!さいしょのもくてきちをきめました!$です!みなさんがさいしょにめざすもくてきちは$です!",#0
"サイコロをふりますか?", #1
"サイコロをふりました。でためは$です!", #2
"$1はプラスえきにとまった!プラス$2円!$1のもちがねは$3円になった!", #3
"$1はマイナスえきにとまった!マイナス$2円!$1はしゃっきんをしたが、めんじょされてもちがね0円になった!", #4
"$1はマイナスえきにとまった!マイナス$2円!$1のもちがねは$3円になった!", #5
"$はカードがいっぱいだ!せっきょくてきにつかおう!", #6
"$1は$2をGETした!", #7
"$はたかくてかえません!", #8
"$をかいました!", #9
"$1が、$2をしょゆうしていますのでかえません!",#10
"$1にはえんじょきんをうけとっていただきます!$1には$2えんのえんじょきんがでました!それではみなさん!あたらしいもくてきちはここです!$3です!さあみなさん!$3にむかってがんばってください!",#11,
"$1をつかいました。でためは$2です!",#12
"$1さんは1ねんかんぶんのりし$2円をうけとりました!!!!!!",#13
"しゅうりょうしました!!!ゆうしょうしゃは、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、、そうしさん$1円の$2さんです!おめでとうございます!"#13
]
